[
    {
        "source_path": "../courseInstances/Fa25/lecture-01a/outline.json",
        "content": {
            "lectureId": "1_mtmivyvl",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "01a",
            "title": "Class plan and rules; Challenges in Decarbonizing our Energy",
            "videoTitle": "ME40 - 27 Aug 2025 - Lecture 1a (edited)",
            "module": "module-one",
            "instructor": "tschutzius",
            "year": "Fa25",
            "topic": "Introduction",
            "subtopics": [
                {
                    "key": "Fa25-L1a-1.0",
                    "title": "Course theme",
                    "summary": "This course is chiefly concerned with energy and its transformations.",
                    "time_range": "00:11 - 00:47",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The core theme of the thermodynamics course is **energy** and its transformation. The instructor highlights three main, timely areas: **energy conversion** (citing photovoltaics as the fastest-growing area), **energy consumption** (citing data centers and large language models), and **energy storage** (necessary because renewable sources are intermittent). These topics collectively form the central focus of the course.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-2.0",
                    "title": "Instructional staff",
                    "summary": "GSIs: Cassidy McCormick, Jessica Wu; Reader: Dheer",
                    "time_range": "00:48 - 02:18",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The instructional staff includes **Cassie McCormick** (Head GSI), **Jessica Woo** (GSI), and **Dear Baldwa** (Reader). The instructor introduces himself, noting he has taught thermodynamics for 11 years, including 10 years overseas at **ETH Zurich**, where Albert Einstein was a student. He recounts an anecdote about Einstein, who was famously a \"very bad student\" and was helped by a friend with his coursework and later got his first job at the **patent office in Bern**. The instructor connects this story to the city of Bern's Glockenspiel (big clock) as a potential source of inspiration for Einstein's daily thoughts on time.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-3.0",
                    "title": "Course learning objectives",
                    "summary": "The course objectives focus on understanding and applying the First and Second Laws of Thermodynamics, moving from foundational concepts and simple problems to analyzing bigger systems and thermodynamic data using Python.",
                    "time_range": "02:19 - 03:43",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The main learning objectives are centered on mastering the **First and Second Laws of Thermodynamics** to the point of being able to articulate them clearly. Students will first solve simple, single-answer problems involving both laws. The course then transitions to applying these laws to much bigger systems, including the study of **perpetual motion cycles** (cycles that violate the First and Second Laws). A key modern component is the shift from using old-school appendix tables to utilizing **Python modules** for handling and determining thermodynamic data, which is presented as a crucial skill for the course.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-4.0",
                    "title": "Course logistics and grading",
                    "summary": "Course material is organized into three modules (First Law, Second Law, Applications). Assessments are handled through the PrairieLearn website, and the grading is weighted heavily toward exams, with a final exam replacement policy and a 3% extra credit option for early PrairieLearn certification.",
                    "time_range": "03:44 - 06:50",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The course is organized into three main modules: **First Law, Second Law, and Applications**. Homework and assessments are administered via the **PrairieLearn** website, and students are strongly encouraged to complete the first three homework assignments and master the Python property determination module. The course grading breakdown is: **Homeworks (10%)**, **Quiz 1 (15%)** (focused on property determination, the only quiz), **Midterm 1 (20%)**, **Midterm 2 (25%)**, and **Final Exam (30%)**. A key policy is the **Final Exam Replacement** rule, which allows the final exam grade to replace a lower grade from a midterm or Quiz 1. All assessments are **open book, open notes, and open internet**, but communication (open discussion) is strictly prohibited. The instructor offers a **3% extra credit** incentive for students who become certified on two specific modules within PrairieLearn.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-5.0",
                    "title": "Challenges in decarbonizing",
                    "summary": "A key part of America's plan to slash carbon emissions: Plug in (almost) everything.",
                    "time_range": "06:51 - 15:00",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The discussion on decarbonization begins with a comparison of CO2 emissions versus national wealth for major global markets (US, China, Germany), highlighting the US as a key focus for mechanical engineers. The core of the current decarbonization challenge is the shift in strategy. In California, the financial incentive for rooftop solar under **NEM 2.0** was drastically reduced by **75%** with the introduction of **NEM 3.0**. The new strategy emphasizes **electrification**, which involves replacing natural gas appliances (stoves, water heaters) with electric alternatives like induction cooktops and **heat pump water heaters**. This creates a massive market and challenge for mechanical engineers to innovate in designing compact and efficient electric and **thermal storage** systems to overcome installation hurdles in existing infrastructure.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-6.0",
                    "title": "Data centers and energy consumption",
                    "summary": "Data centers, especially those for large language models, consume immense and rapidly growing energy, primarily due to the heat generated, requiring innovative thermal management solutions like liquid cooling and the use of thermal/battery storage.",
                    "time_range": "15:01 - 19:12",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "Data centers, particularly those powering **large language models (LLMs)** like ChatGPT, represent a rapidly growing area of energy consumption, with a single large center consuming power equivalent to a small town. The primary challenge is managing the tremendous amount of waste **heat** generated by the servers, which is currently removed by power-intensive **chillers** (large air conditioners). This high-density energy challenge necessitates innovative thermal management strategies, such as **liquid cooling**, where servers are submerged in dielectric fluids. Furthermore, the intermittent nature of renewable energy (solar and wind) drives the need for **thermal and battery storage**. For data centers, **cold thermal storage** is highlighted as a solution to run chillers during off-peak hours (at night) when electricity is cheaper, storing the \"cold\" for use during the day.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-7.0",
                    "title": "Introduction to the first law of thermodynamics",
                    "summary": "This segment introduces the First Law of Thermodynamics, which formalizes the principle of **Conservation of Energy**, defining its components (internal energy, heat, and work) and establishing sign conventions for thermodynamic systems.",
                    "time_range": "19:13 - 40:13",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The introduction to the First Law of Thermodynamics establishes the fundamental principle of **Conservation of Energy**. The law is mathematically expressed as $\\Delta U = Q - W$, relating the change in a system's internal energy ($\\Delta U$) to the energy transferred via **heat ($Q$)** and **work ($W$)**. The lecture defines a **system** and its **boundary**, which are crucial for applying the law. It clarifies the **sign conventions** for heat and work: **Heat ($Q$)** is positive when added to the system, and **Work ($W$)** is positive when done *by* the system. This foundational law is essential for subsequent course modules, including the analysis of engineering cycles and non-violating perpetual motion concepts.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1a-8.0",
                    "title": "Closing remarks",
                    "summary": "Thermodynamics is a funny subject. The first time you go through it you don't understand it at all. The second time...",
                    "time_range": "40:14 - 40:46",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "The closing remarks feature a famous quote from the German physicist **Arnold Sommerfeld** on the experience of learning thermodynamics. The quote suggests that initially, the subject is completely unintelligible, becomes partially clear upon the second pass, and finally, by the third pass, one accepts their lack of full understanding but has become accustomed to it.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-01b/outline.json",
        "content": {
            "lectureId": "1_r5zqwxag",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "01b",
            "title": "Basic concepts",
            "videoTitle": "ME40 - 29 Aug 2025 - Lecture 1b (edited)",
            "module": "module-one",
            "instructor": "tschutzius",
            "year": "Fa25",
            "topic": "Introduction",
            "subtopics": [
                {
                    "key": "Fa25-L1b-1.0",
                    "title": "PrairieLearn and PrairieTest",
                    "summary": "How to show your work on your PrairieLearn homework. Please log onto PrairieTest.",
                    "time_range": "00:00 - 01:51",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The instructor covered logistics for homework submission on **PrairieLearn**, instructing students to upload **one PDF** of their work (including photos of handwritten notes) as accreditation depends on it. Students are encouraged to report errors using the system's error button or by messaging the instructor. For assessments and quizzes, the **PrairieTest** platform is introduced, which is used for computer-based testing at SDH, and students are advised to log in and **stay ahead** in the course work.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-2.0",
                    "title": "Learning Objectives",
                    "summary": "",
                    "time_range": "01:52 - 02:59",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The segment outlines the **learning objectives** for the lecture, focusing on **basic concepts of thermodynamics** like postulates, systems, equilibrium, process, and cycle, along with defining **independent and dependent properties** and **pure substances**. The goal is for students to be able to **determine all thermodynamic properties** using the **pyCalor** Python module, a calculation tool written by Professor Frenklach.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-3.0",
                    "title": "Thermodynamics",
                    "summary": "It is the science of energy.",
                    "time_range": "03:00 - 06:12",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "Thermodynamics is introduced as the **science of energies**, historically focused on converting **heat to work** and vice-versa. The field's origin is traced to **Sadi Carnot** in the 19th century, whose work on engine efficiency contributed to the **Second Law of Thermodynamics**, and to **Julius Robert von Mayer** (a physician), who developed the idea of the **First Law**. The term \"thermodynamics\" comes from Greek/Latin for \"heat\" and \"power.\" While the field has branched into chemistry and information theory, the course will retain the focus on **mechanical work** and treat systems as a **continuum**, consistent with the axiom of **conservation of energy**. The microscopic view of disordered atomic motion is left to courses like statistical mechanics.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-4.0",
                    "title": "Thermodynamic Postulates and Systems",
                    "summary": "The fundamental laws are assumed as postulates based on experimental evidence. The first thing you should do when you do a thermodynamics problem is to draw a boundary.  Describes the State Postulate.",
                    "time_range": "06:13 - 08:31",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The segment focuses on the **postulate-based approach** of thermodynamics and the critical first step in problem-solving: defining a **volume/boundary** where **heat and work interactions** occur. It introduces the concept of an **equation of state**, explaining that if one can measure a sufficient number of **independent properties** (typically two), all other properties of the system can be determined. This principle is illustrated using the **Ideal Gas Law** ($P=f(V,T)$), where knowing two independent properties provides **complete information** about the system's state.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-5.0",
                    "title": "Independent and Dependent Properties",
                    "summary": "For a pure substance, if we know two independent variables, we then can determine a third dependent property. We can determine the properties of a pure substance using pyCalor. ",
                    "time_range": "08:32 - 13:29",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "This section uses **multivariable calculus** to illustrate the relationship between **two independent properties** ($X_1, X_2$) and the resulting **dependent property** ($X_3$), emphasizing that fixing $X_1$ and $X_2$ defines a specific point on a surface, which also yields information about the **derivatives** (rate of change). This principle is valid for a **pure substance** (like nitrogen or air, but not air with condensed liquid oxygen). The lecture connects this to the **pyCalor Python module**, where defining the substance and **two independent properties** creates a state object ($\text{ST}$) from which all other properties (e.g., $\text{ST.U}$) can be calculated, thereby simplifying complex calculations in a cycle (e.g., using a PV diagram).",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-6.0",
                    "title": "Energy",
                    "summary": "Historical development of energy. The term energy was coined by Thomas Young. Lord Kelvin proposed that it be used in Thermodynamics (1852). Later on the term internal energy and its symbol U were introduced by R. Clausius and W. Rankine.",
                    "time_range": "13:30 - 20:27",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The segment delves into the history and nomenclature of **energy**, which was coined by **Thomas Young** (1807), proposed for thermodynamics by **Lord Kelvin** (1852), and given the symbol **U** for **Internal Energy** by **Rudolf Clausius**. The discussion emphasizes that thermodynamics is interested in **changes in energy** from a **reference state**, not absolute values. **Little $u$** ($u$) is defined as **internal energy per mass** (J/kg) for a **simplified system** where motion, gravity, and external fields are **neglected**. In this case, $u$ depends only on two independent properties (e.g., T and specific volume), allowing its values to be **tabulated** (or calculated by pyCalor). **Big $U$** ($U$) is the **total internal energy** (Joules).",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-7.0",
                    "title": "Internal energy",
                    "summary": "The internal energy of a system is the sum of all forms of the microscope energies. We denote internal energy as U. ",
                    "time_range": "20:28 - 21:50",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "This section explains the **storage mechanisms** that contribute to a system's **internal energy**. These mechanisms include: **Translational** energy (kinetic energy of gas molecules), energy from **strong interactions** (like hydrogen bonding in condensed water), and **Chemical energy** (from reactions). All these forms of stored energy collectively constitute the system's internal energy.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-8.0",
                    "title": "Determining the properties of nitrogen",
                    "summary": "Prof. Schutzius shows how by knowing two independent properties we know multiple dependent properties, in addition to the one dependent property we mentioned before. That additional information comes from taking the derivative of the line at that point. ",
                    "time_range": "21:51 - 23:40",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The instructor returns to the concept that **two independent properties** ($X_1, X_2$) provide complete information about a system's state. Using a plot of **Internal Energy ($U$) vs. Specific Volume ($v$) and entropy ($S$)**, the lecture demonstrates how to determine other properties using **derivatives**. Specifically, the **derivative** of $U$ with respect to $v$ at constant $S$ yields **pressure (P)**, and the derivative of $U$ with respect to $S$ at constant $v$ yields **temperature (T)**. This illustrates that once the point is defined by $X_1$ and $X_2$, all other properties follow from mathematical relations.",
                    "examples": [
                        "nitrogenInternalEnergyPressureVolumePlot"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-9.0",
                    "title": "Group work",
                    "summary": "",
                    "time_range": "23:41 - 25:20",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The instructor initiates a **group work** session to enhance learning. The problem involves a **rigid container (constant volume and mass)** of a substance at a known **State 1** that undergoes a process of **heating**. Students are asked to determine: 1) the **change in internal energy** of the system, and 2) how to **determine the final state (State 2)** after the heat transfer. Students are instructed to put their names down and be ready to answer once the accompanying poll is launched.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-10.0",
                    "title": "Thermodynamics: State of a pure substance",
                    "summary": "Defines the saturation dome and the different phases. ",
                    "time_range": "25:21 - 26:39",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "This segment introduces the **graphical representation** of a pure substance's state, specifically using a **Pressure ($P$) vs. Specific Volume ($v$) plot** for water. The plot includes the **saturation regions**, which outline the **\"dome\"** where liquid and vapor phases coexist. The different state regions shown include liquid, vapor, and **superheated vapor**, and the plot can also feature **isotherms** (lines of constant temperature) to help determine the system's state.",
                    "examples": [
                        "waterPhaseDiagram"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-11.0",
                    "title": "Thermodynamics: Equilibrium",
                    "summary": "",
                    "time_range": "26:40 - 27:23",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "The discussion introduces the concept of a **process** (specifically, a constant volume process) and the idea of a **quasi-equilibrium process**. The segment uses an example of a piston-cylinder setup to visualize a quasi-equilibrium process, which is one where the system is displaced slowly.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L1b-12.0",
                    "title": "Thermodynamics: Transformation or Process",
                    "summary": "Transformation from state 1 to state 2. A transformation is reversible when the successive states differ by infinitesimals from equilibrium states. ",
                    "time_range": "27:24 - 29:29",
                    "topics": [
                        "Introduction"
                    ],
                    "detailed_summary": "Continuing the piston-cylinder example, the lecture compares a **slow (quasi-equilibrium) compression** versus a **very fast compression**. The comparison shows that the final temperature is **lower** in the slow process than in the fast process. The higher temperature in the fast process is explained as being due to **friction and heat** generated by the rapid movement of the fluid and the chaotic \"banging\" of atoms.",
                    "examples": [
                        "waterPhaseDiagram"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-02a/outline.json",
        "content": {
            "lectureId": "1_0uijb1pt",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "02a",
            "title": "Energy, Energy Transfer, and General Energy Analysis",
            "videoTitle": "ME40 - 3 Sept 2025 - Lecture 2a (edited)",
            "module": "module-one",
            "instructor": "tschutzius",
            "year": "Fa25",
            "topic": "Energy",
            "subtopics": [
                {
                    "key": "Fa25-L2a-1.0",
                    "title": "Learning Objectives",
                    "summary": "",
                    "time_range": "00:00 - 00:15",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The lecture's **learning objectives** include covering **energy** concepts, **thermodynamic cycles**, **internal energy**, **heat**, and **energy transfer** mechanisms via **heat and work**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-2.0",
                    "title": "Thermodynamic cycle",
                    "summary": "Import transformations are those for which the initial and final states are the same. They are called cyclical transformations or cycles.",
                    "time_range": "00:16 - 02:37",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "A **thermodynamic cycle** is defined as a series of **processes** that returns the system to its initial **state** ($\\\\Delta E=0$). Cycles are a primary focus for mechanical engineers, as they are crucial for technologies like **jet propulsion** and **electricity generation**, which convert **heat into work** and vice versa.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-3.0",
                    "title": "Problem solving technique",
                    "summary": "When you solve a problem be sure to do the following: Write the problem statement, draw a schematic including the boundary of the system, state assumptions and approximations, write the physical laws, write the properties and how you determined them, show your calculations, and give your reasoning. ",
                    "time_range": "02:38 - 04:12",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "A structured **problem-solving technique** is emphasized: 1) **Write the problem statement**; 2) **Draw a schematic** showing the system **boundaries**; 3) State all **assumptions** (e.g., ideal gas); 4) List **physical laws** (e.g., First Law of Thermodynamics); 5) **Calculate properties** and show reasoning. The instructor notes that demonstrating **logical thinking** and process is significantly more important for grading (14/15 points) than the final answer itself.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-4.0",
                    "title": "Sensible energy: Portion of internal energy associated with kinetic energy",
                    "summary": "",
                    "time_range": "04:12 - 06:23",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "For a simple system, **internal energy ($U$)** depends on two independent properties. The internal energy of **ideal gases** is stored through several mechanisms that contribute to sensible energy, including **translational** energy (simple movement of the molecules). More complex or **polyatomic** molecules can also store internal energy via **rotational** and **vibrational** motion. Additionally, electrons within the atoms can possess **spin energy**. All these molecular and atomic movements are the **mechanisms that contribute to the total internal energy** of the system.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-5.0",
                    "title": "Energy transfer by heat",
                    "summary": "In this example Prof Schutzius shows a molecular dynamics simulation and how heat is transferred at the molecular scale. ",
                    "time_range": "06:24 - 11:11",
                    "topics": [
                        "Energy"
                    ],
                    "ddetailed_summary": "Energy is exchanged between systems when **thermal energy moves from a region of high concentration to one of low concentration**. This process continues until **thermal equilibrium** is reached, where all parts of the system are at the same temperature and **no further heat transfer occurs**. A molecular dynamics simulation can demonstrate this: a partition of high-velocity (hot) molecules will cool down, while a partition of low-velocity (cold) molecules will increase in temperature until they reach the same, intermediate temperature. The **direction of heat transfer** is determined *only* by the **temperature difference ($\\\\Delta T$)** and is independent of the mass or total internal energy of the objects involved. When two systems are in contact but **mass transfer is not allowed**, the boundary is referred to as a **diathermal wall**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-6.0",
                    "title": "Energy transfer to a closed system",
                    "summary": "",
                    "time_range": "11:12 - 14:23",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "For a **closed system** (a fixed mass that does not cross the boundary), the **First Law of Thermodynamics** states that the only two ways to exchange energy with the surroundings are through **heat or work**. This is the fundamental definition of a closed system. The **direction of heat transfer** is determined *only* by the **temperature difference ($\\\\Delta T$)**, moving from the higher temperature region to the lower temperature region. Conversely, **work** is any energy transfer mechanism *other than* heat.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-7.0",
                    "title": "Adiabatic process",
                    "summary": "",
                    "time_range": "14:24 - 20:02",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-8.0",
                    "title": "Terminology",
                    "summary": "",
                    "time_range": "20:03 - 21:05",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "An **adiabatic process** is one in which there is absolutely **no heat transfer** ($Q=0$). This occurs when the system boundary is perfectly insulated, which is called an **adiabatic wall**. The first law of thermodynamics for a closed system ($\\\\Delta U = Q - W$) simplifies to $\\\\Delta U = -W$ for an adiabatic process, meaning the change in internal energy is due entirely to **work**. The discussion clarifies the difference between an adiabatic process, which only means $Q=0$, and a **reversible** process, which means there are no entropy-generating irreversibilities like friction.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-9.0",
                    "title": "Energy transfer by work to a closed system",
                    "summary": "",
                    "time_range": "21:06 - 29:42",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "For a **closed system** (a fixed mass with no mass crossing the boundary), the **only** two ways to exchange energy with the surroundings are through **heat or work**. Work transfer is commonly illustrated by the **expansion and contraction** of a gas in a piston-cylinder device. The definitive method to classify an energy transfer is to ask if it is heat: **heat transfer** requires a **temperature difference ($\\\\Delta T$)** across the boundary. If the energy transfer in a closed system occurs with **no temperature difference**, it must be classified as **work**. For example, **electrical energy input** (from a resistor) into a closed system is considered work, as its transfer does not inherently depend on a $\\\\Delta T$ across the boundary. Therefore, the **choice of the system boundary** is a critical first step in determining the nature of the energy exchange.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-10.0",
                    "title": "Energy transfer to a closed system",
                    "summary": "",
                    "time_range": "29:43 - 32:59",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The section summarizes the **First Law of Thermodynamics** for a **closed system** as $\\\\Delta U = Q_{in} - W_{out}$. This relationship shows that the change in **Internal Energy ($\\\\Delta U$)** is equal to the net energy transferred via heat and work. The terms are carefully distinguished: **Internal Energy ($U$)** is a **property** that only depends on the start and end states (point function), while **Heat ($Q$)** and **Work ($W$)** are **path functions** (requiring knowledge of the entire process). The two primary idealized cases discussed are: 1) The **adiabatic process** ($Q=0$), where $\\\\Delta U = -W$, meaning the change in internal energy is due entirely to work; and 2) The **constant volume process** (such as isochoric heating), where $W=0$, and $\\\\Delta U = Q$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-11.0",
                    "title": "Energy balance of a system",
                    "summary": "Consider a closed system. Shaft work is transferred in and heat is transferred out. The initial internal energy is given. Determine the final internal energy. ",
                    "time_range": "33:00 - 43:06",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "This section solves an energy balance problem (a paddle work example) by applying the **First Law of Thermodynamics** to a **closed system**. The problem involves **shaft work input** ($W_{in}$) from a paddle wheel and **heat output** ($Q_{out}$) to the surroundings. The change in internal energy ($\\\\Delta U$) is calculated using the form $\\\\mathbf{U_2 - U_1 = W_{in} - Q_{out}}$.",
                    "examples": [
                        "energyTransferClosedSystem"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2a-12.0",
                    "title": "Mechanisms of Energy Transfer For a Closed System",
                    "summary": "For a closed system undergoing a cycle, the initial and final states are identical.",
                    "time_range": "43:07 - 46:19",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "This section serves as a final review, reiterating that energy transfer for a **closed system** (fixed mass) occurs exclusively through **heat ($Q$) or work ($W$)**. For a **thermodynamic cycle**, since the initial and final states are identical, the change in internal energy is zero ($\\\\mathbf{\\\\Delta U = 0}$). Therefore, the **First Law of Thermodynamics** for a cycle simplifies to state that the **net work must equal the net heat transfer** ($\\\\mathbf{W_{net} = Q_{net}}$). This emphasizes that work and heat are **path functions**, while internal energy is a **property** (state function).",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-02b/outline.json",
        "content": {
            "instructor": "tschutzius",
            "year": "Fa25",
            "lectureId": "1_h0h8llrr",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "02b",
            "title": "Energy, Energy Transfer, and General Energy Analysis",
            "videoTitle": "ME40 - 5 Sept 2025 - Lecture 2b (edited)",
            "module": "module-one",
            "topic": "Energy",
            "subtopics": [
                {
                    "key": "Fa25-L2b-1.0",
                    "title": "Learning Objectives",
                    "summary": "",
                    "time_range": "00:00 - 00:29",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The lecture will cover **energy transfer**, focusing on the concepts of **work**, **electrical work**, and **mechanical work**. It will also delve into the **First Law of Thermodynamics**, including a detailed **problem-solving approach**. If time allows, **fluid flowing as energy transfer** will be discussed.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2b-2.0",
                    "title": "Examples of mechanical work",
                    "summary": "Prof. Schutzius analyzes the work done on a spring. ",
                    "time_range": "00:30 - 11:30",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The discussion covers mechanical work, including the **$W=FS$** formula and the concept of **shaft work**. A **spring example** is analyzed using **Hook's law** to derive the work done as **$\frac{1}{2}KX^2$**, assuming a **slow, reversible process**. The **First Law of Thermodynamics** ($\\Delta E_{system} = E_{in} - E_{out}$) is applied, where $\\Delta E$ includes **internal, kinetic, and potential energy**, and energy transfer is via **work (W) or heat (Q)**. For the slow spring compression, the energy balance simplifies to **$\\Delta PE = W_{in}$**. The effect of **rapid stretching** is discussed, noting it causes the system to **warm up** due to a sudden reduction of **entropy**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2b-3.0",
                    "title": "Group work",
                    "summary": "",
                    "time_range": "11:31 - 13:22",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The lecture poses a **group work problem** analyzing a **thin soap film (bubble)** on a frame as another type of spring. The key concept is **surface tension**, which acts **parallel to the interface** and has units of **Newtons per meter**. Assuming a **reversible process**, students are asked to derive the **formula for the force** and the **work done ($dW$)** when the film is stretched a distance $dx$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2b-4.0",
                    "title": "Electrical work",
                    "summary": "",
                    "time_range": "13:33 - 15:20",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The section on **electrical work** distinguishes between **work** and **heat transfer**, noting that **heat transfer requires a temperature gradient**. Energy transfer across a control volume boundary is classified as **work** if the **electrons cross the boundary** (e.g., drawing the boundary across the wires of a resistor), but as **heat** if the **boundary is drawn around the heating element** and the surrounding air (e.g., heat transfer from the hot resistor). The **choice of control volume** is emphasized as being crucial to the solution.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2b-5.0",
                    "title": "The First Law of Thermodynamics",
                    "summary": "",
                    "time_range": "15:21 - 17:06",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "The **First Law of Thermodynamics** is presented as the principle of **conservation of energy** and is analogous to **accounting**. The core equation states that the **change in energy of the control volume** ($\\Delta E_{CV}$) equals **$E_{in} - E_{out}$**. Energy is transferred only through **work and heat**. The preferred notation for solving problems is the explicit use of $W_{in}$, $W_{out}$, $Q_{in}$, and $Q_{out}$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2b-6.0",
                    "title": "Mechanisms of energy transfer to or from a closed system",
                    "summary": "The only ways that energy can be transferred in or out of a closed system is through heat or work.",
                    "time_range": "16:40 - 17:07",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "This short section defines a **closed system** as one with **no mass transfer**, which is the context for the energy balance equations previously discussed.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L2b-7.0",
                    "title": "Isochoric cooling example",
                    "summary": "1 kg of air treated as an ideal gas is kept inside a rigid container. The initial pressure and temperature are 100 kPa and 100 deg. C, respectively. It is then cooled until it reaches 80 kPa. What is the final temperature? How much heat is transferred out?",
                    "time_range": "17:08 - 28:49",
                    "topics": [
                        "Energy"
                    ],
                    "detailed_summary": "An example of **isochoric (constant volume) cooling** of **air** in a **rigid, impermeable container** is solved. The goal is to determine the final temperature ($T_2$) and the heat transferred out ($Q_{out}$). The First Law simplifies to $\\Delta U = -Q_{out}$ because for an **isochoric process, work is zero** ($W_{in} = W_{out} = 0$). For an ideal gas, the **change in internal energy ($\\Delta U$) depends only on temperature**. Using the **specific heat at constant volume ($c_v$)**, the relation is $m c_v (T_2 - T_1) = -Q_{out}$. The **ideal gas equation** ($p v = R T$) is then used to compute the state properties needed to find $T_2$ and $Q_{out}$.",
                    "examples": [
                        "isochoricCoolingIdealGas"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-03a/outline.json",
        "content": {
            "instructor": "tschutzius",
            "year": "Fa25",
            "lectureId": "1_qk0vncag",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "03a",
            "title": "Pure Substance",
            "videoTitle": "ME40 - 8 Sept 2025 - Lecture 3a (edited)",
            "module": "module-one",
            "topic": "Properties",
            "subtopics": [
                {
                    "key": "Fa25-L3a-1.0",
                    "title": "Learning Objectives",
                    "summary": "Prof. Schutzius explains the learning objectives for this lecture.",
                    "time_range": "00:00 - 00:50",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment starts the lecture by stating the current topic is **pure substances**. The lecturer asks students to register on **us.prairietest.com** and then outlines the learning objectives: discussing the concept of a **pure substance**, illustrating it on various **diagrams** to be used throughout the semester, and developing **procedures to determine thermodynamic properties**. The plan is to teach the 'hand tool' (tables) and then show the 'power tool' (computational methods), with the expectation that students will use the power tool.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3a-2.0",
                    "title": "Pure Substance",
                    "summary": "Prof. Schutzius explains what a pure substance is.",
                    "time_range": "00:51 - 05:08",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This section explains what a **pure substance** is. A substance must have a **uniform chemical composition throughout**. Examples given are **water** (in multiple phases) and **nitrogen**. The lecture clarifies that a mixture like air is a pure substance, but warns that if one component is condensed out (e.g., **condensing oxygen out of air**), the **ratio is no longer the same**, and it **ceases to be a pure substance**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3a-3.0",
                    "title": "Phase change processes of pure substances",
                    "summary": "Prof. Schutzius explains phase change processes. Defines subcooled liquids, saturated liquid-vapor mixtures, and superheated vapor. During the transformation from a saturated liquid to vapor this occurs at constant temperature and pressure. ",
                    "time_range": "05:09 - 06:32",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment introduces the process of **phase change** by discussing the concepts of **compressed liquid, saturated liquid, saturated mixture, saturated vapor, and superheated vapor**. The lecture focuses on how these phases relate to **pressure and temperature** for a pure substance and begins to set up the visualization of this process on a diagram.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3a-4.0",
                    "title": "(p,v,T) surface of a pure substance",
                    "summary": "For a pure substance, you only need two independent property to determine a third dependent property. Think about the ideal gas equation as an example. ",
                    "time_range": "06:33 - 15:50",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This long segment is devoted to illustrating the phase change process using the **Temperature-Specific Volume (T-v) diagram**. The concepts of **isobaric lines (constant pressure lines)** and the **saturated liquid and saturated vapor lines** are introduced, forming the **vapor dome**. The segment discusses the **critical point** where the saturated liquid and saturated vapor states become identical, and it defines the **supercritical fluid region**. It then introduces the **quality ($x$)** property, which is the mass fraction of vapor in the saturated mixture, and explains that $x$ ranges from 0 (saturated liquid) to 1 (saturated vapor).",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3a-5.0",
                    "title": "Property diagrams for phase change processes: Terminology",
                    "summary": "The book explains what the different phases are called. Compress liquid region, saturated liquid-vapor region, superheated vapor region. Supercritical fluid.",
                    "time_range": "15:51 - 22:29",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This section reinforces the **terminology** used in property diagrams. It defines and locates the **compressed liquid region** (or subcooled liquid), the **saturated liquid-vapor mixture region** (inside the dome), the **superheated vapor region** (outside the dome, right side), and the **supercritical fluid region**. The lecture then introduces the **Pressure-Specific Volume (P-v) diagram**, which also contains the vapor dome, but with **isothermal lines (constant temperature lines)** used for visualization.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3a-6.0",
                    "title": "Property tables",
                    "summary": "Prof. Schutzius explains how one can determine properties the old fashioned way using property tables. ",
                    "time_range": "22:30 - 29:19",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment explains the **old-fashioned way** of determining properties using **property tables** (like steam tables). The lecturer demonstrates how to use the tables to identify the phase of a substance based on a single given property (e.g., specific volume, $v$) and how to find the corresponding pressure or temperature. The concept of **interpolation** for finding values between those listed in the tables is also introduced, with a mention that this method assumes linearity.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3a-7.0",
                    "title": "Determine the properties of water at 200 deg. C and 150 kPa",
                    "summary": "Here Prof. Schutzius shows you how you can determine the properties of water using pressure and temperature as an input. These are independent properties because it's not in the saturated liquid-vapor region. The python package we use for this is pyCalor.",
                    "time_range": "29:20 - 30:45",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "The segment introduces an example problem to **determine the properties of water** given the input of **temperature ($T=200^{\\circ}\\text{C}$) and pressure ($P=150\\text{ kPa}$)**. The lecturer notes that these are **independent properties** because the state is *not* in the saturated liquid-vapor region. It is hypothesized that the state is a **superheated vapor** due to the high temperature. The segment then shows how to use a computational tool (pyCalor, Python, dot notation) to define a substance object and directly access properties like internal energy ($u$) and specific volume ($v$).",
                    "examples": [
                        "waterPropertiesPyCalor"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-03b/outline.json",
        "content": {
            "instructor": "tschutzius",
            "year": "Fa25",
            "lectureId": "1_blyiho9t",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "03b",
            "title": "Property Tables; Ideal Gas",
            "videoTitle": "ME40 - 10 Sept 2025 - Lecture 3b (edited)",
            "module": "module-one",
            "topic": "Properties",
            "subtopics": [
                {
                    "key": "Fa25-L3b-1.0",
                    "title": "Workspace in PrairieLearn",
                    "summary": "Prof. Schutzius explains that it is important for students to learn to use Workspace in PrairieLearn. Students will use that to launch a Jupyter notebook which has pyCalor. You will use pyCalor to determine thermodynamic properties.",
                    "time_range": "00:08 - 02:51",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment introduces the **Workspace in PrairieLearn**. Students are instructed on the importance of learning to use this workspace to launch a **constrained Jupyter notebook**. This notebook comes with pre-installed packages, such as **pyCalor**, which is necessary to determine **thermodynamic properties**. The lecturer emphasizes that the template used in the practice problems is the **same exact one** that will be used in the quiz.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3b-2.0",
                    "title": "Thermodynamics: State",
                    "summary": "Prof. Schutzius explains what an equation of state is",
                    "time_range": "02:52 - 12:37",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "The core topic of this segment is the definition of a **Thermodynamic State** and the **Equation of State**. The lecture moves beyond using only equations by discussing the use of **property tables** for determining thermodynamic properties. The discussion stresses the need for **units** when using the computational tools, reminding students that engineering is not just math.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3b-3.0",
                    "title": "Ideal gas expansion in a tank",
                    "summary": "A rigid tank is divided into two parts by a partition. One side of the tank contains an ideal gas at a temperature 460 deg. C, volume V_1, and pressure p_1. The other side of the tank is evacuated and has a volume V_2 = 5 V_1. The partition is then removed and the gas expands to fill both sides of the tank. heat is then transferred to the gas until the pressure is equal to the initial pressure, p_2 = p_1. Determine the final temperature, T_2, in the tank.",
                    "time_range": "12:38 - 21:57",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment introduces the **Ideal Gas Law** in two forms: $PV = n R_u T$ (molar basis) and $PV = M R T$ (mass basis). It is presented as the simplest equation of state and a good approximation for gas behavior. The conditions for its validity are defined: when **gas density is low** (low pressure and high temperature). The lecturer warns **not to use** the Ideal Gas Law for substances near their saturation point, such as **water** or **refrigerants**, because the model assumes **negligible molecule volume** and **negligible attractive forces**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3b-4.0",
                    "title": "Group Work: Cooling of a superheated vapor",
                    "summary": "A system is initially at p_1 = 5 MPa and T_1 = 600 deg C. You cool it down with constant pressure until it's a saturated vapor, x_2 = 1. What is T_2 for the water vapor? What is T_2 for an ideal gas? ",
                    "time_range": "21:58 - 23:01",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment presents an example problem involving a **cooling process of water**. The objective is to determine the final exit temperature ($T_2$) of the water vapor by comparing two methods: first, by determining properties accurately using **thermodynamic tables**; and second, by making the **ideal gas assumption** for the water vapor.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3b-5.0",
                    "title": "van der Waals equation of state",
                    "summary": "Prof. Schutzius shows a pressure-volume diagram for a van der Waals equation of state. He describes what the van der Waals equation of state is. It is essentially the ideal gas law that accounts for molecular interaction. ",
                    "time_range": "23:02 - 25:13",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "Prof. Schutzius introduces the **van der Waals equation of state**, which is a modification of the ideal gas law. This equation attempts to provide a more accurate model for real gases by **accounting for molecular interaction**. The segment includes a visual representation of this equation on a **Pressure-Volume (P-V) diagram**.",
                    "examples": [
                        "vanDerWaalsEquationOfState"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3b-6.0",
                    "title": "van der Waals equation of state",
                    "summary": "Here Prof. Schutzius defines metastability, something that naturally is derived from the van der Waals equation of state. ",
                    "time_range": "25:14 - 30:56",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This section focuses on the concept of **metastability**. Metastability is defined as a condition, such as **superheated liquid** or **subcooled vapor**, that is naturally derived from the shape of the van der Waals equation's isotherms. This condition represents a temporary, unstable state that is outside the equilibrium curve.",
                    "examples": [
                        "vanDerWaalsPlot",
                        "redlichKwong"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L3b-7.0",
                    "title": "Derivation of specific heats",
                    "summary": "",
                    "time_range": "30:57 - 34:18",
                    "topics": [
                        "Properties"
                    ],
                    "detailed_summary": "This segment introduces the concept of **specific heat ($c_v$)** and discusses the units of specific heat (energy per mass per degree Kelvin or Celsius). It explains that specific heat is the proportionality constant that relates **heat input** to the expected **temperature change** ($\\\\Delta T$). The discussion relates this to **Joule's experiment**. The segment foreshadows the conclusion that for an **ideal gas**, **internal energy ($U$) is only dependent on temperature**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-04a/outline.json",
        "content": {
            "instructor": "tschutzius",
            "year": "Fa25",
            "lectureId": "1_fclugwz7",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "04a",
            "title": "Energy Analysis of Closed Systems",
            "videoTitle": "ME40 - 12 Sept 2025 - Lecture 4a (edited)",
            "module": "module-one",
            "topic": "Closed Systems",
            "subtopics": [
                {
                    "key": "Fa25-L4a-1.0",
                    "title": "Quiz 1",
                    "summary": "Prof. Schutzius describes the details of quiz 1, which requires students to register. Students will take the quiz at the computer-based testing facility. Prof. Schutzius also explains how to prepare for the quiz using Module 1 review on PrairieLearn.",
                    "time_range": "00:10 - 01:42",
                    "topics": [
                        ""
                    ],
                    "detailed_summary": "This segment introduces the day's topic, **energy analysis of closed systems**, but mainly focuses on details for **Quiz 1**. The lecturer explains that the quiz will be a **computer-based test**, directs students to the Quiz one page for all details, and encourages them to use the **Module one review** on PrairieLearn for practice quizzes.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L4a-2.0",
                    "title": "Applications: Engines and Compressors",
                    "summary": "Prof. Schutzius describes the applications of boundary work to engines.",
                    "time_range": "01:43 - 03:24",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This section introduces the practical application of **boundary work** to devices like **engines and compressors**. The lecturer also sets the stage for the day's problem-solving session, mentioning they will cover four problems, including one that involves **adiabatic expansion**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L4a-3.0",
                    "title": "Moving boundary work",
                    "summary": "Prof. Schutzius explains that pistons are moving too quickly to be at equilibrium. We choose to analyze these processes as quasi-equilibrium processes though, which isn't a bad assumption.",
                    "time_range": "03:25 - 04:25",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This segment revisits the concept of the **work term** in thermodynamics, providing a **physical meaning** to the vital **quasi-equilibrium assumption**, which is necessary for simplifying the analysis of thermodynamic processes.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L4a-4.0",
                    "title": "Moving boundary polytropic processes",
                    "summary": "",
                    "time_range": "04:26 - 14:01",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This long segment is dedicated to calculating **moving boundary work** for a **polytropic process**, which follows the relationship $P V^n = C$ (where C is a constant). The focus is on applying the work integral ($W = \\int P dV$) to a system with a moving boundary undergoing this type of change.",
                    "examples": [
                        "workMovingBoundary"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L4a-5.0",
                    "title": "Moving boundary work: Adiabatic process",
                    "summary": "",
                    "time_range": "14:02 - 31:12",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This extended segment focuses on calculating **moving boundary work** for an **adiabatic process**. An example problem illustrating **adiabatic expansion** is solved. This section shows how to apply the appropriate work equation and the first law of thermodynamics for a process with no heat transfer.",
                    "examples": [
                        "adiabaticExpansion"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L4a-6.0",
                    "title": "Group work: Analyze three different work processes",
                    "summary": "Which process transfer a higher magnitude of work? If the process is isothermal, which process is an ideal gas?",
                    "time_range": "31:13 - 31:52",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This brief section is dedicated to a **Group Work** activity where students are asked to **analyze three different work processes**. The two key questions posed are: Which process transfers a **higher magnitude of work**? and which process is an **ideal gas** if the process is isothermal?. The discussion would connect the answers to the geometric interpretation of work as the **area under the curve on a P-V diagram**.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L4a-7.0",
                    "title": "Net work",
                    "summary": "Prof. Schutzius explains what net work is for a cycle.",
                    "time_range": "31:53 - 34:39",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This segment analyzes the net work and energy transfer for a **thermodynamic cycle** shown on a P-V diagram. The key point established is that the **net work out ($W_{net, out}$)** of a closed-system cycle is graphically represented by the **area enclosed by the cycle’s path** on the P-V diagram. By applying the **First Law of Thermodynamics** ($\\\\Delta U = Q_{net, in} - W_{net, out}$) to a cycle, and recognizing that the **change in internal energy ($\\\\Delta U$) is zero** (since the system returns to its initial state), the lecturer concludes that the **net work output must equal the net heat input ($W_{net, out} = Q_{net, in}$)**. This relationship is a fundamental concept for analyzing engines and other cyclic devices.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa23/lecture-04/specificHeat/outline.json",
        "content": {
            "instructor": "tschutzius",
            "year": "Fa23",
            "lectureId": "1_gytyosq5",
            "courseCaptureId": "rtl_course_capture",
            "lecture": "04-prework-specificHeat",
            "title": "Energy Analysis of Closed Systems",
            "videoTitle": "ME40 - Video 4 - Specific Heat (edited)",
            "module": "module-one",
            "topic": [
                "Closed Systems"
            ],
            "subtopics": [
                {
                    "key": "Fa23-L4p-1.0",
                    "title": "Definition of Specific Heat",
                    "summary": "Introduces **Specific Heat** as the property that quantifies the energy required to raise the temperature of a unit mass of a substance by one degree (Celsius or Kelvin).",
                    "time_range": "00:00 - 10:40",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "The section defines **specific heat ($c$)** as the fundamental property that quantifies the amount of heat energy ($Q$) required to raise the temperature ($\\Delta T$) of a unit mass ($m$) of a substance. It is the parameter that dictates the temperature response of a system to a given heat transfer. The concept is illustrated by comparing materials like iron and water: for the same amount of heat transferred, water's temperature rises minimally compared to iron's, demonstrating water's **high specific heat capacity** and its ability to store a large amount of energy. Specific heat is shown to be non-constant, varying based on the **nature of the substance** and the molecular **modes of energy storage**. The lecture notes that substances with more available molecular modes (e.g., rotational and vibrational modes) generally exhibit a higher specific heat. Finally, the lecture introduces two types of specific heat, which are especially relevant for gases, as the heat transferred depends on the process path: **Specific Heat at Constant Volume ($c_v$)** for isochoric processes (e.g., in an automobile engine) and **Specific Heat at Constant Pressure ($c_p$)**. The core mathematical relationship is given by $Q = m c \\Delta T$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa23/lecture-04/specificHeatsIdealGases/outline.json",
        "content": {
            "lectureId": "1_po01te89",
            "courseCaptureId": "rtl_course_capture",
            "lecture": "04-prework-specificHeatIdealGases",
            "title": "Energy Analysis of Closed Systems",
            "videoTitle": "ME40 - Video 4 - Specific Heats and Ideal Gases (edited)",
            "module": "module-one",
            "year": "Fa23",
            "instructor": "tschutzius",
            "topics": "Closed Systems",
            "subtopics": [
                {
                    "key": "Fa23-L4q-1.0",
                    "title": "Joule's experiment",
                    "summary": "Joule's experiments demonstrated the equivalence of heat and mechanical work and showed that the internal energy of an ideal gas is dependent only on temperature, not volume or pressure.",
                    "time_range": "00:00 - 04:04",
                    "topics": [
                        "Closed Systems",
                        "Properties"
                    ],
                    "detailed_summary": "This section reviews James Joule's experiments from the 1850s, which aimed to establish a relationship between mechanical work and heat. The first experiment involved a paddle wheel spinning in water, powered by a dropping weight, with a thermometer recording the temperature rise, directly linking mechanical work input to a heat equivalent. The second, more complex experiment involved two bulbs connected by a valve and submerged in a liquid bath: one bulb contained high-pressure air, and the other was evacuated. Upon opening the valve, the air underwent free expansion into the vacuum. By treating the two-bulb system and the bath as a control volume, and observing that there was no significant temperature change in the bath, Joule was able to conclude that the internal energy of the gas is not a function of volume or pressure, only temperature ($U=U(T)$).",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa23-L4q-2.0",
                    "title": "Internal energy of an ideal gas",
                    "summary": "The internal energy of an ideal gas only depends on temperature.",
                    "time_range": "04:05 - 09:51",
                    "topics": [
                        "Closed Systems",
                        "Properties"
                    ],
                    "detailed_summary": "The key takeaway from Joule's free expansion experiment is the demonstration that for an **ideal gas**, the internal energy ($\\mathbf{U}$) is a function of temperature only ($U=U(T)$). Consequently, the change in internal energy ($\\Delta U$) for an ideal gas is calculated by integrating the specific heat at constant volume ($c_v$) over the temperature range: $\\Delta U = \\int m c_v(T) dT$. For engineering applications, especially over a small temperature range, the $\\Delta U$ equation is often simplified using an average specific heat value ($c_{v,avg}$) as $\\Delta U = c_{v,avg} \\Delta T$. Similarly, the **enthalpy** ($H$) of an ideal gas is also temperature-dependent only, and its change ($\\Delta H$) is calculated using the specific heat at constant pressure ($c_p$): $\\Delta H = \\int m c_p(T) dT$ (or $\\Delta H = m c_{p,avg} \\Delta T$ using the average specific heat approximation). For accurate, temperature-dependent values of $c_p$ and $c_v$, the instructor recommends using the python module pyCalor.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa23-L4q-3.0",
                    "title": "Using tables to determine the properties of an ideal gas",
                    "summary": "Prof. Schutzius doesn't recommend using tables to determine the properties of an ideal gas. He suggests using pyCalor (python module for determining thermodynamic properties).",
                    "time_range": "09:52 - 14:17",
                    "topics": [
                        "Closed Systems",
                        "Properties"
                    ],
                    "detailed_summary": "The discussion addresses the methods for obtaining ideal gas properties, particularly highlighting the challenges with using **thermodynamic tables** (like Table A-17). The instructor advises **against** relying on these tables for ideal gas calculations. Use the python module pyCalor to determine the properties of an ideal gas if you want to be very accurate.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa23-L4q-4.0",
                    "title": "Specific heats as a function of temperature and the relationship between $c_p$ and $c_v$",
                    "summary": "The difference between the specific heat at constant pressure ($c_p$) and specific heat at constant volume ($c_v$) for an ideal gas is equal to the gas constant ($R$), given by the relationship $\\mathbf{c_p = c_v + R}$.",
                    "time_range": "14:18 - 16:32",
                    "topics": [
                        "Closed Systems",
                        "Properties"
                    ],
                    "detailed_summary": "This segment establishes the relationship between the two main specific heats for an ideal gas. By starting with the definition of enthalpy ($H=U+PV$), substituting the **ideal gas equation** ($PV=RT$), and taking the differential, the fundamental relationship is derived. The steps are: $H = U + RT$, leading to $dH = dU + R dT$. Replacing the differentials with their specific heat definitions ($dH = C_p dT$ and $dU = C_v dT$) yields $C_p dT = C_v dT + R dT$. This simplifies to the key equation: $\\mathbf{C_p = C_v + R}$. This relationship confirms that the difference between $C_p$ and $C_v$ is equal to the specific gas constant $R$ (on a mass basis, J/kg$\\cdot$K) or the universal gas constant $\\bar{R}$ (on a molar basis, J/mol$\\cdot$K), with $C_p$ always being greater than $C_v$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-04c/outline.json",
        "content": {
          "instructor": "tschutzius",
          "year": "Fa25",
          "lectureId": "1_3375c5yj",
          "courseCaptureId": "rtl_course_capture_2258_29147",
          "lecture": "04c",
          "title": "Energy Analysis of Closed Systems",
          "videoTitle": "ME40 - 15 Sept 2025 - Lecture 4c (edited)",
          "module": "module-one",
          "topic": "Closed Systems",
          "subtopics": [
            {
              "key": "Fa25-L4c-1.0",
              "title": "Electric heating of water vapor at constant pressure",
              "summary": "We are transferring electrical work into a piston cylinder. The system is kept at constant pressure. Heat is transferred in. Determine the final temperature of the steam. Determine the difference in enthalpy between the initial and final state.",
              "time_range": "00:29 - 19:46",
              "topics": ["Closed Systems"],
              "detailed_summary": "This segment introduces and solves an **energy balance problem for a closed system** (fixed mass) involving water vapor in a piston-cylinder device. The process involves **electrical work transferred in ($W_{e, in}$) and heat transfer ($Q$)** while the system is maintained at **constant pressure**. The key theoretical derivation shows that for a constant pressure closed system, the boundary work can be absorbed into the internal energy term ($U$), resulting in a simplified energy balance where $Q_{net, in} + W_{e, in} = \Delta H$ (or $Q_{net, in} + W_{e, in} = m \\\\Delta h$). The example is solved using **superheated steam tables** to determine the final temperature and the change in enthalpy.",
              "examples": ["electricHeatingWaterVaporConstantPressure"],
              "tags":["tschutzius","beta"]
            },
            {
              "key": "Fa25-L4c-2.0",
              "title": "Electrical heating and cooling of a cylinder containing nitrogen at constant pressure",
              "summary": "A piston cylinder contains nitrogen. Electrical work is transferred in and heat is transferred out. Boundary work is done. The initial state is given. Determine the final temperature.",
              "time_range": "19:47 - 37:25",
              "topics": ["Closed Systems"],
              "detailed_summary": "This section solves a second closed-system problem, this time involving **Nitrogen ($N_2$) gas** in a constant-pressure piston-cylinder device. The process involves **electrical work input ($W_{e, in}$), heat loss ($Q_{out}$), and boundary work**. Since Nitrogen is treated as an **ideal gas**, the enthalpy change ($\\Delta h$) is approximated using the **constant pressure specific heat ($C_p$)** and temperature change, $\\\\Delta h \\\\approx C_p \\\\Delta T$. The constant pressure energy balance ($Q_{net, in} + W_{e, in} = m \\\\Delta h$) is used to determine the **final temperature ($T_2$)** of the gas.",
              "examples": ["nitrogenHeatingWorkTransfer"],
              "tags":["tschutzius","beta"]
            },
            {
              "key": "Fa25-L4c-3.0",
              "title": "Internal energy, enthalpy, specific heats of solids and liquids",
              "summary": "Prof. Schutzius defines specific heat, c_p, c_v, for liquids and solids (incompressible substances).",
              "time_range": "37:26 - 42:55",
              "topics": ["Closed Systems"],
              "detailed_summary": "This segment introduces the simplified thermodynamic properties for **incompressible substances** (liquids and solids). For these substances, the **specific heat at constant volume ($c_v$) is equal to the specific heat at constant pressure ($c_p$)**, and both are generally represented as $c$. Furthermore, because the specific volume ($v$) is essentially constant, the **change in internal energy ($\\\\Delta u$) is approximately equal to the change in enthalpy ($\\Delta h$)**. The key relationship derived for property change is $\\\\Delta u \\\\approx \\\\Delta h \\\\approx c \\\\Delta T$.",
              "examples": [""],
              "tags":["tschutzius","beta"]
            },
            {
              "key": "Fa25-L4c-4.0",
              "title": "Solve energy balance problems for closed (fixed-mass) systems that involve heat and work interactions",
              "summary": "Here Prof. Schutzius summarizes the problems he has solved so far for energy balances of closed systems. One was for steam and another was for an ideal gas. ",
              "time_range": "42:56 - 43:15",
              "topics": ["Closed Systems"],
              "detailed_summary": "This final section first provides a brief summary of the closed-system energy balance problems solved so far (steam and ideal gas). It then introduces a new example: the **cooling of a hot solid block (iron) dropped into a cold water bath**. The combined system (iron + water) is treated as an **adiabatic, closed system** with no work, meaning the **total change in internal energy is zero** ($\\\\Delta U_{sys} = 0$). The objective is to determine the **final equilibrium temperature ($T_2$)** by setting the sum of the internal energy changes for the iron and the water to zero, using the $\\\\Delta U = m c \\\\Delta T$ approximation for both incompressible components.",
              "examples": [""],
              "tags":["tschutzius","beta"]
            },
            {
              "key": "Fa25-L4c-5.0",
              "title": "Cooling of a solid block",
              "summary": "Prof. Schutzius analyzes the cooling of a solid block. Iron of m = 50 kg with an initial temperature of 80 deg C  is dropped into a water bath of volume 0.5 cubic meters and initially at a temperature of 25 deg C. Determine the temperature when equilibrium is reached.",
              "time_range": "43:16 - 48:47",
              "topics": ["Closed Systems"],
              "detailed_summary": "This segment introduces and begins solving a new closed-system example: the **cooling of a hot solid block (iron) dropped into a cold water bath**. This process is treated as an **adiabatic, closed system** with no work, leading to the **total change in internal energy being zero** ($\\\\Delta U_{sys} = 0$). The objective is to determine the **final equilibrium temperature ($T_2$)** by summing the internal energy changes for the iron and the water to zero. Since both are **incompressible substances** (solid and liquid), the property change approximation $\\\\Delta U \\\\approx m c \\\\Delta T$ is used for each component.",
              "examples": ["coolingSolidBlock"],
              "tags":["tschutzius","beta"]
            }
          ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-05a/outline.json",
        "content": {
            "lectureId": "1_0r6wkz1o",
            "instructor": "tschutzius",
            "year": "Fa25",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "05a",
            "title": "Mass and Energy Analysis of Control Volumes",
            "videoTitle": "ME40 - 17 Sept 2025 - Lecture 5a (edited)",
            "module": "module-one",
            "topic": "Control Volumes",
            "subtopics": [
                {
                    "key": "Fa25-L5a-1.0",
                    "title": "Cooling of a solid block",
                    "summary": "Prof. Schutzius analyzes the cooling of a solid block. Iron of m = 50 kg with an initial temperature of 80 deg C  is dropped into a water bath of volume 0.5 cubic meters and initially at a temperature of 25 deg C. Determine the temperature when equilibrium is reached.",
                    "time_range": "00:22 - 11:13",
                    "topics": [
                        "Closed Systems"
                    ],
                    "detailed_summary": "This segment completes an **example problem for a closed system** (the cooling of a solid block) that was introduced in a previous lecture. The problem involves a hot piece of iron dropped into a cold water bath. The overall process is treated as **adiabatic** with **no work exchange**. The core principle applied is the **conservation of energy** for the combined system, stating that the change in the system's **internal energy** is zero ($\\\\Delta U = 0$). The goal is to determine the final equilibrium temperature ($T_2$) by summing the change in internal energy for the iron and the water, using the approximation $\\\\Delta U \\\\approx m C \\\\Delta T$.",
                    "examples": [
                        "coolingSolidBlock"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5a-2.0",
                    "title": "Develop the conservation of mass principle",
                    "summary": "Here Prof. Schutzius derives conservation of mass for a control volume.",
                    "time_range": "11:14 - 28:44",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "This section is dedicated to developing the **Conservation of Mass Principle** for a **Control Volume (CV)**. The derivation uses the **Reynolds Transport Theorem (RTT)** to relate the time rate of change of mass in the system to the change of mass within the CV plus the net mass flow across the boundaries. The final result is the rate form of the mass balance equation: $\\\\frac{dM_{CV}}{dt} = \\\\sum_{in} \\\\dot{m}_{in} - \\\\sum_{out} \\\\dot{m}_{out}$. The lecturer then simplifies this for **steady flow**, where the mass of the CV is constant, leading to the condition that the mass flow rate in must equal the mass flow rate out: $\\\\sum \\\\dot{m}_{in} = \\\\sum \\\\dot{m}_{out}$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5a-3.0",
                    "title": "Developing the conservation of energy equation for a control volume",
                    "summary": "In addition to heat and work, mass can transfer energy into a control volume. Here Prof. Schutzius does this analysis. He also develops the enthalpy property, which he shows is the result of separating flow work from total work. The remaining work term is then useful shaft work.",
                    "time_range": "28:45 - 40:34",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "The focus shifts to developing the **Conservation of Energy Equation** for a **Control Volume**. This analysis accounts for energy transfer via heat, work, and mass flow. A crucial step is the separation of **total work** into **flow work (\\\\dot{W}_{flow})** and **shaft work (\\\\dot{W}_{shaft})**. The derivation then introduces the property of **enthalpy ($h = u + Pv$)**, which conveniently combines the internal energy ($u$) carried by the mass flow with the necessary flow work ($Pv$). This results in the final energy term carried by the mass flow being a combination of $h + ke + pe$.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5a-4.0",
                    "title": "Applying conservation of mass and energy principles for a control volume to a turbine.",
                    "summary": "",
                    "time_range": "40:35 - 48:58",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "This segment applies the derived principles to an example problem involving a **steam turbine**. The goal is to determine the **rate of work output (\\\\dot{W}_{out})** of the turbine. The full **Steady Flow Energy Equation (SFEE)** is applied, including changes in enthalpy (\\\\Delta h), kinetic energy (\\\\Delta ke), and potential energy (\\\\Delta pe). The lecturer demonstrates how the enthalpy change terms dominate, allowing for a simplification of the equation to primarily: $\\\\dot{W}_{out} = \\\\dot{m} (h_1 - h_2)$, where $h_1$ and $h_2$ are specific enthalpies at the inlet and exit, respectively. The final work output is calculated using the property values obtained from steam tables (pyCalor).",
                    "examples": [
                        "turbineEnthalpyVsInternalEnergy"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-05b/outline.json",
        "content": {
            "lectureId": "1_hb7swztw",
            "instructor": "tschutzius",
            "year": "Fa25",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "05b",
            "title": "Mass and Energy Analysis of Control Volumes",
            "videoTitle": "ME40 - 19 Sept 2025 - Lecture 5b (edited)",
            "module": "module-one",
            "topic": "Control Volumes",
            "subtopics": [
                {
                    "key": "Fa25-L5b-1.0",
                    "title": "Flow Work",
                    "summary": "Prof. Schutzius summarizes the previous derivation of flow work. We separate flow work from the total work such that the remaining work term is useful work, i.e., shaft work.",
                    "time_range": "00:22 - 03:13",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "This segment continues the discussion on **mass and energy analysis for control volumes** and **steady-flow devices**. The lecturer reviews the concept of **flow work**, which is the work required to push a fluid into or out of a control volume, illustrated by an imaginary piston at the inlet/outlet. This leads to the definition of **enthalpy ($H$)** as the combination of **internal energy ($U$)** and **flow work ($PV$)**. The use of **specific enthalpy ($h = u + Pv$)** is justified because it greatly simplifies the **Steady Flow Energy Equation (SFEE)** by combining the internal energy and flow work into a single property.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5b-2.0",
                    "title": "Energy Analysis of a Steady-flow System",
                    "summary": "",
                    "time_range": "03:14 - 17:55",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "This section begins by presenting the full **Steady Flow Energy Equation (SFEE)**, including terms for specific enthalpy, kinetic energy, and potential energy. The equation is then applied to various **steady-flow devices** such as turbines, compressors, nozzles, diffusers, throttling valves, and heat exchangers, with the necessary **simplifying assumptions** outlined for each. The core of the segment is an **example problem involving an air turbine**. The problem is solved to find the exit temperature ($T_2$) by applying the simplified SFEE, $\\dot{W}_{out} = \\dot{m} (h_1 - h_2)$, and using enthalpy values from tables. An alternative solution is demonstrated using the **ideal gas approximation** where the change in enthalpy is $\\Delta h = C_p \\Delta T$, and its precision relative to the table method is discussed.",
                    "examples": [
                        ""
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5b-3.0",
                    "title": "Example: Energy Analysis of a Steady-flow System: Compressor",
                    "summary": "Prof. Schutzius determines the power transferred into a compressor given the inlet state, outlet set, heat loss per unit mass, and mass flow rate. We neglect changes in kinetic and potential energy. We  can use pyCalor to determine the properties.",
                    "time_range": "17:56 - 31:23",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "This final segment introduces **Example 2: An Air Compressor Problem**.",
                    "examples": [
                        "compressorPyCalor"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    },
    {
        "source_path": "../courseInstances/Fa25/lecture-05c/outline.json",
        "content": {
            "lectureId": "1_97hqf37r",
            "instructor": "tschutzius",
            "year": "Fa25",
            "courseCaptureId": "rtl_course_capture_2258_29147",
            "lecture": "05c",
            "title": "Mass and Energy Analysis of Control Volumes",
            "videoTitle": "ME40 - 22 Sept 2025 - Lecture 5c (edited)",
            "module": "module-one",
            "topic": "Control Volumes",
            "subtopics": [
                {
                    "key": "Fa25-L5c-1.0",
                    "title": "Throttling and Expansion Valves",
                    "summary": "In this problem, Prof. Schutzius analyzes a throttling process. This is an important component of a refrigeration system.",
                    "time_range": "00:28 - 19:45",
                    "topics": [
                        "Control Volumes",
                        "Refrigeration"
                    ],
                    "detailed_summary": "The segment focuses on **throttling valves/expansion valves** within a refrigeration cycle, emphasizing that it is an **isenthalpic process** ($\\mathbf{h_{\\text{in}} = h_{\\text{out}}}$). This condition is met by assuming **no work** and **no heat transfer** (adiabatic/insulated, which is valid for a small orifice or porous plug). This expansion causes a temperature decrease, known as the **Joule-Thompson effect**. The process is visualized on a **pressure-enthalpy (p-h) diagram**, where a saturated liquid at high pressure ($x=0$) expands along a constant enthalpy line into a two-phase liquid-vapor mixture at lower pressure.",
                    "examples": [
                        "throttlingPyCalor"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5c-2.0",
                    "title": "Heat Exchanger",
                    "summary": "Example: Energy analysis of a steady flow system: Heat exchanger: R134a refrigerant. It enters a heat exchanger as a vapor with a mass flow rate of 6 kg/min and leaves as a subcooled liquid. Neglect pressure drops. Determine the mass flow rate of the cooling water and the heat transfer rate from the refrigerant to the water.",
                    "time_range": "19:46 - 41:14",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "The segment analyzes a **heat exchanger** under **Steady-Flow Energy Analysis (SFEA)**. The overall energy balance for the adiabatic heat exchanger simplifies to $\\mathbf{\\sum \\dot{m}_{\\text{in}} h_{\\text{in}} = \\sum \\dot{m}_{\\text{out}} h_{\\text{out}}}$. Applying this to the two streams (refrigerant, $R$, and water, $w$): $\\mathbf{\\dot{m}_R (h_1 - h_2) = \\dot{m}_w (h_4 - h_3)}$. The problem involves determining the mass flow rate of the cooling water ($\\dot{m}_w$) and the heat transfer rate from the refrigerant to the water ($\\mathbf{\\dot{Q}_{\\text{out}} = \\dot{m}_R (h_1 - h_2)}$), which is also equal to the heat gained by the water ($\\mathbf{\\dot{Q}_{\\text{in}} = \\dot{m}_w (h_4 - h_3)}$).",
                    "examples": [
                        "heatExchangerPyCalor"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                },
                {
                    "key": "Fa25-L5c-3.0",
                    "title": "Energy analysis of unsteady flow processes",
                    "summary": "Prof. Schutzius explains how one can analyze an unsteady flow process.",
                    "time_range": "41:15 - 50:26",
                    "topics": [
                        "Control Volumes"
                    ],
                    "detailed_summary": "The segment introduces **unsteady-flow analysis**, where **mass and energy within the Control Volume (CV) change over time** (e.g., tank charging/discharging). The governing equations are the **General Mass Balance** ($\\mathbf{\\dot{m}_{\\text{in}} - \\dot{m}_{\\text{out}} = \\frac{dm_{\\text{CV}}}{dt}}$) and the **General Energy Balance**.",
                    "examples": [
                        "co2ReliefModeling"
                    ],
                    "tags": [
                        "tschutzius",
                        "beta"
                    ]
                }
            ]
        }
    }
]